internal/adapters/sat/templates/verify_request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:des="http://DescargaMasivaTerceros.sat.gob.mx">
    <soapenv:Header/>
    <soapenv:Body>
        <des:VerificaSolicitudDescarga>
            <des:solicitud IdSolicitud="{{.IdSolicitud}}" RfcSolicitante="{{.RfcSolicitante}}">
                <Signature xmlns="http://www.w3.org/2000/09/xmldsig#">
                    <SignedInfo>
                        <CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
                        <SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
                        <Reference URI="">
                            <Transforms>
                                <Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
                            </Transforms>
                            <DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                            <DigestValue>{{.DigestValue}}</DigestValue>
                        </Reference>
                    </SignedInfo>
                    <SignatureValue>{{.SignatureValue}}</SignatureValue>
                    <KeyInfo>
                        <X509Data>
                            <X509IssuerSerial>
                                <X509IssuerName>{{.IssuerName}}</X509IssuerName>
                                <X509SerialNumber>{{.SerialNumber}}</X509SerialNumber>
                            </X509IssuerSerial>
                            <X509Certificate>{{.Certificate}}</X509Certificate>
                        </X509Data>
                    </KeyInfo>
                </Signature>
            </des:solicitud>
        </des:VerificaSolicitudDescarga>
    </soapenv:Body>
</soapenv:Envelope>